'''
# 알고리즘
- 주어진 문제를 해결하기 위한 단계적인 절차를 말한다.
- 컴퓨터에서 어떤 일을 하는 절차를 표현하기 위해 명령어들을 사용하는데, 알고리즘은 특정한 일을 수행하는 명령어들의 집합이다.
    - 명령어(instruction set) : 컴퓨터에서 수행되는 문장들을 의미한다.
- 프로그래밍 언어와 상관없이 문제 해결 절차를 나타내는 명령어의 집합이다. 

# 알고리즘의 조건
- 입력 : 모호하지 않고 잘 정의된 입력
- 명확성 : 각 명령어의 의미가 모호하지 않고 명확해야 한다.
- 언어 독립성 : 프로그래밍 언어와 상관 없다.
- 출력 : 명확히 정의된 1개 이상의 출력
- 유한성 : 한정된 수의 단계 후에는 반드시 종료되어야 한다.
- 유효성 : 명령어들은 현재 실행 가능한 연산이어야 한다.

- 알고리즘 대부분은 입력을 요구하지만 때로는 입력이 필요 없는 경우가 있다.
    - ex) 난수 발생 알고리즘
    - 하지만 반드시 하나 이상의 출력은 있어야 한다.    
'''